"""Площадь круга и длина окружности."""

import math

def area(r):
    """ Принимает радиус r, возвращает площь круга радиуса r.

    Формула: S = π * r².

    Аргументы:
        r (число): Радиус круга.

    Возвращает:
        число: Площадь круга.

    Пример вызова:
        >>> area(1)
        3.141592653589793
    """
    return math.pi * r ** 2


def perimeter(r):
    """ Принимает радиус r,возвращает длину окружности

    Формула: P = 2 * π * r.

    Аргументы:
        r (число): Радиус круга.

    Возвращает:
        число: Длина окружности.

    Пример вызова:
        >>> perimeter(2)
        12.566370614359172
    """
    return 2 * math.pi * r