"""Площадь и периметр квадрата."""


def area(a):
    """Считает площадь квадрата, зная длину его стороны.

    Формула: S = a².

    Аргументы:
        a (число): Длина стороны квадрата.

    Возвращает:
        число: Площадь квадрата.

    Пример вызова:
        >>> area(3)
        9
    """
    return a ** 2


def perimeter(a):
    """Считает периметр квадрата, зная длину его стороны.

    Формула: P = 4 * a.

    Аргументы:
        a (число): Длина стороны квадрата.

    Возвращает:
        число: Периметр квадрата.

    Пример вызова:
        >>> perimeter(4)
        16
    """
    return 4 * a